node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 200
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 200
          }
        }
        string_val: ".\\tfrecords\\voc_2007_train_000.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_001.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_002.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_003.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_004.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_005.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_006.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_007.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_008.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_009.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_010.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_011.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_012.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_013.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_014.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_015.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_016.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_017.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_018.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_019.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_020.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_021.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_022.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_023.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_024.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_025.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_026.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_027.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_028.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_029.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_030.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_031.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_032.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_033.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_034.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_035.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_036.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_037.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_038.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_039.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_040.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_041.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_042.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_043.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_044.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_045.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_046.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_047.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_048.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_049.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_050.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_051.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_052.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_053.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_054.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_055.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_056.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_057.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_058.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_059.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_060.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_061.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_062.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_063.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_064.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_065.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_066.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_067.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_068.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_069.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_070.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_071.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_072.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_073.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_074.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_075.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_076.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_077.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_078.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_079.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_080.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_081.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_082.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_083.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_084.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_085.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_086.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_087.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_088.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_089.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_090.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_091.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_092.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_093.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_094.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_095.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_096.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_097.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_098.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_099.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_100.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_101.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_102.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_103.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_104.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_105.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_106.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_107.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_108.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_109.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_110.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_111.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_112.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_113.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_114.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_115.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_116.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_117.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_118.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_119.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_120.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_121.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_122.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_123.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_124.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_125.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_126.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_127.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_128.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_129.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_130.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_131.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_132.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_133.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_134.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_135.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_136.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_137.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_138.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_139.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_140.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_141.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_142.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_143.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_144.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_145.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_146.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_147.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_148.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_149.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_150.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_151.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_152.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_153.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_154.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_155.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_156.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_157.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_158.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_159.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_160.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_161.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_162.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_163.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_164.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_165.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_166.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_167.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_168.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_169.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_170.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_171.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_172.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_173.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_174.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_175.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_176.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_177.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_178.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_179.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_180.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_181.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_182.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_183.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_184.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_185.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_186.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_187.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_188.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_189.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_190.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_191.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_192.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_193.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_194.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_195.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_196.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_197.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_198.tfrecord"
        string_val: ".\\tfrecords\\voc_2007_train_199.tfrecord"
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 200
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Greater/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Greater"
  op: "Greater"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/Size"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/Greater/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Assert/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Assert/Assert/data_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Assert/Assert"
  op: "Assert"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/Greater"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/Assert/Assert/data_0"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/Identity"
  op: "Identity"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/Const"
  input: "^pascalvoc_2007_data_provider/parallel_read/filenames/Assert/Assert"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 200
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/RandomShuffle"
  op: "RandomShuffle"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/Identity"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 200
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/filenames_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/RandomShuffle"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/filenames_Close"
  op: "QueueCloseV2"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/filenames_Close_1"
  op: "QueueCloseV2"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/filenames_Size"
  op: "QueueSizeV2"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/ToFloat"
  op: "Cast"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/filenames_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/mul"
  op: "Mul"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/ToFloat"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/fraction_of_32_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "pascalvoc_2007_data_provider/parallel_read/filenames/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/filenames/fraction_of_32_full"
  op: "ScalarSummary"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/fraction_of_32_full/tags"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  op: "RandomShuffleQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 160
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 80
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_Size"
  op: "QueueSizeV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/ToFloat"
  op: "Cast"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0062500001
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/mul"
  op: "Mul"
  input: "pascalvoc_2007_data_provider/parallel_read/ToFloat"
  input: "pascalvoc_2007_data_provider/parallel_read/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/fraction_of_160_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "pascalvoc_2007_data_provider/parallel_read/fraction_of_160_full"
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/fraction_of_160_full"
  op: "ScalarSummary"
  input: "pascalvoc_2007_data_provider/parallel_read/fraction_of_160_full/tags"
  input: "pascalvoc_2007_data_provider/parallel_read/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2"
  op: "TFRecordReaderV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2_1"
  op: "TFRecordReaderV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2_2"
  op: "TFRecordReaderV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2_3"
  op: "TFRecordReaderV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2"
  op: "ReaderReadV2"
  input: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2:1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_1"
  op: "ReaderReadV2"
  input: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2_1"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_enqueue_1"
  op: "QueueEnqueueV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_1"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_1:1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_2"
  op: "ReaderReadV2"
  input: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2_2"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_enqueue_2"
  op: "QueueEnqueueV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_2"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_2:1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_3"
  op: "ReaderReadV2"
  input: "pascalvoc_2007_data_provider/parallel_read/TFRecordReaderV2_3"
  input: "pascalvoc_2007_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_enqueue_3"
  op: "QueueEnqueueV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_3"
  input: "pascalvoc_2007_data_provider/parallel_read/ReaderReadV2_3:1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_Close"
  op: "QueueCloseV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_Close_1"
  op: "QueueCloseV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/parallel_read/common_queue_Dequeue"
  op: "QueueDequeueV2"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/key_image/encoded"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/key_image/encoded"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/key_image/format"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "jpeg"
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape_1/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape_1"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/key_image/format"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape_1/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Const_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Const_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/Const_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample"
  op: "ParseSingleExample"
  input: "pascalvoc_2007_data_provider/parallel_read/common_queue_Dequeue:1"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Const"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Reshape_1"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Const_1"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Const_2"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/Const_3"
  device: "/device:CPU:0"
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_STRING
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dense_keys"
    value {
      list {
        s: "image/channels"
        s: "image/encoded"
        s: "image/format"
        s: "image/height"
        s: "image/shape"
        s: "image/width"
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "num_sparse"
    value {
      i: 7
    }
  }
  attr {
    key: "sparse_keys"
    value {
      list {
        s: "image/object/bbox/Difficult"
        s: "image/object/bbox/label"
        s: "image/object/bbox/truncated"
        s: "image/object/bbox/xmax"
        s: "image/object/bbox/xmin"
        s: "image/object/bbox/ymax"
        s: "image/object/bbox/ymin"
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:21"
  input: "pascalvoc_2007_data_provider/Reshape/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_1/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_1"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:22"
  input: "pascalvoc_2007_data_provider/Reshape_1/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_2/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_2"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:23"
  input: "pascalvoc_2007_data_provider/Reshape_2/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_3/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_3"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:24"
  input: "pascalvoc_2007_data_provider/Reshape_3/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_4/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_4"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:25"
  input: "pascalvoc_2007_data_provider/Reshape_4/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_5/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Reshape_5"
  op: "Reshape"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:26"
  input: "pascalvoc_2007_data_provider/Reshape_5/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/SparseToDense/default_value"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/SparseToDense"
  op: "SparseToDense"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:1"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:15"
  input: "pascalvoc_2007_data_provider/ParseSingleExample/ParseSingleExample:8"
  input: "pascalvoc_2007_data_provider/SparseToDense/default_value"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "pascalvoc_2007_data_provider/Equal/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
